In [2]:
import pandas as pd

In [3]:
df1 = pd.DataFrame({'RollNo':[1,2,3,4,5], 'Maths':[64,52,84,46,61], 'Physics':[43,95,65,76,38]})
df2 = pd.DataFrame({'RollNo':[6,7,8,9,10], 'Maths':[74,63,41,86,50], 'Physics':[49,65,53,26,98]})
print(df1)
print(df2)

   RollNo  Maths  Physics
0       1     64       43
1       2     52       95
2       3     84       65
3       4     46       76
4       5     61       38
   RollNo  Maths  Physics
0       6     74       49
1       7     63       65
2       8     41       53
3       9     86       26
4      10     50       98

In [4]:
df_combined = pd.concat([df1, df2])

In [5]:
df_combined

   RollNo  Maths  Physics
0       1     64       43
1       2     52       95
2       3     84       65
3       4     46       76
4       5     61       38
0       6     74       49
1       7     63       65
2       8     41       53
3       9     86       26
4      10     50       98

In [6]:
data = {
    "Branch": ["CSE", "IT", "CSE", "ECE","CSE", "IT", "CSE", "ECE","IT", "CSE", "ECE"],
    "Subject": ["ADA", "DBMS", "OOP", "CN", "DBMS", "OOP", "CN", "DBMS", "OOP", "CN", "CN"],
    "Marks": [85, 90, 78, 88, 58, 69, 86, 74, 66, 38, 91] 
}
df = pd.DataFrame(data)

In [7]:
pivot = df.pivot_table(
    index="Branch",
    values="Marks",  # Use only numeric columns for aggregation
    aggfunc="mean",  # Or another aggregation function
)
print(pivot)

            Marks
Branch
CSE     69.000000
ECE     84.333333
IT      75.000000

In [9]:
pivot = df.pivot_table(
    index="Branch",
    values="Marks",  # Use only numeric columns for aggregation
    aggfunc="sum",  # Or another aggregation function
)
print(pivot)

        Marks
Branch
CSE       345
ECE       253
IT        225

In [10]:
pivot = df.pivot_table(
    index="Branch",
    values="Marks",  # Use only numeric columns for aggregation
    aggfunc="count",  # Or another aggregation function
)
print(pivot)

        Marks
Branch
CSE         5
ECE         3
IT          3

In [ ]:
pivot = df.pivot_table(
    index="Branch",
    values="Marks",  # Use only numeric columns for aggregation
    aggfunc="max",  # Or another aggregation function
)
print(pivot)